<a href="https://colab.research.google.com/github/JakeOh/202011_itw_bd21/blob/main/lab_da/da12_merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

DataFrame 합치기

*   merge(join): 두 개의 DataFrame을 공통된 컬럼(들)을 기준으로 합치는 것.
*   concat: DataFrame 축(axis)을 따라서 합치는 것.

In [1]:
import numpy as np
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'kind': ['a', 'a', 'b', 'b', 'a', 'c'],
    'val_1': range(6)
})

df1

  kind  val_1
0    a      0
1    a      1
2    b      2
3    b      3
4    a      4
5    c      5

In [3]:
df2 = pd.DataFrame({
    'kind': ['a', 'c', 'd'],
    'val_2': [10, 20, 30]
})

df2

  kind  val_2
0    a     10
1    c     20
2    d     30


```
select df1.kind, df1.val_1, df2.val_2
from df1 inner join df2 on df1.kind = df2.kind;
```

In [4]:
pd.merge(left=df1, right=df2)
# pd.merge(left=df1, right=df2, how='inner', on='kind')
# how='inner': merge의 기본값은 innner join이기때문에 생략 가능.
# on='join할 때 사용되는 컬럼(들)': join 조건 컬럼 이름이 같은 경우에는 생략 가능.

  kind  val_1  val_2
0    a      0     10
1    a      1     10
2    a      4     10
3    c      5     20

In [5]:
# df1.merge(df2, how='inner', on='kind')
df1.merge(df2)

  kind  val_1  val_2
0    a      0     10
1    a      1     10
2    a      4     10
3    c      5     20

In [6]:
pd.merge(left=df1, right=df2, how='left')
# NaN: Not a Number
# NA: Not Available

  kind  val_1  val_2
0    a      0   10.0
1    a      1   10.0
2    b      2    NaN
3    b      3    NaN
4    a      4   10.0
5    c      5   20.0

In [7]:
pd.merge(left=df1, right=df2, how='right')

  kind  val_1  val_2
0    a    0.0     10
1    a    1.0     10
2    a    4.0     10
3    c    5.0     20
4    d    NaN     30

In [8]:
pd.merge(left=df1, right=df2, how='outer')

  kind  val_1  val_2
0    a    0.0   10.0
1    a    1.0   10.0
2    a    4.0   10.0
3    b    2.0    NaN
4    b    3.0    NaN
5    c    5.0   20.0
6    d    NaN   30.0

In [9]:
emp = pd.DataFrame({
    'empno': [100, 101],
    'ename': ['Allen', 'Scott'],
    'deptno': [20, 10]
})
emp

   empno  ename  deptno
0    100  Allen      20
1    101  Scott      10

In [10]:
dept = pd.DataFrame({
    'dno': [10, 20],
    'dname': ['IT', 'HR']
})
dept

   dno dname
0   10    IT
1   20    HR

In [11]:
pd.merge(left=emp, right=dept, left_on='deptno', right_on='dno')

   empno  ename  deptno  dno dname
0    100  Allen      20   20    HR
1    101  Scott      10   10    IT

row 인덱스를 사용해서 merge

In [13]:
df1 = pd.DataFrame(data={'data1': range(6)},
                   index=['a', 'b', 'c'] * 2)
df1

   data1
a      0
b      1
c      2
a      3
b      4
c      5

In [14]:
df1.shape

(6, 1)

In [15]:
df1.loc['a', :]

   data1
a      0
a      3

In [18]:
df2 = pd.DataFrame(data={'data2': [11, 22, 33, 44]},
                   index=['a', 'b', 'c', 'd'])
df2

   data2
a     11
b     22
c     33
d     44

In [19]:
pd.merge(left=df1, right=df2, how='inner', left_index=True, right_index=True)

   data1  data2
a      0     11
a      3     11
b      1     22
b      4     22
c      2     33
c      5     33

In [20]:
pd.merge(left=df1, right=df2, how='left', left_index=True, right_index=True)

   data1  data2
a      0     11
a      3     11
b      1     22
b      4     22
c      2     33
c      5     33

In [21]:
pd.merge(left=df1, right=df2, how='right', left_index=True, right_index=True)

   data1  data2
a    0.0     11
a    3.0     11
b    1.0     22
b    4.0     22
c    2.0     33
c    5.0     33
d    NaN     44

In [22]:
pd.merge(left=df1, right=df2, how='outer', left_index=True, right_index=True)

   data1  data2
a    0.0     11
a    3.0     11
b    1.0     22
b    4.0     22
c    2.0     33
c    5.0     33
d    NaN     44

In [23]:
df1

   data1
a      0
b      1
c      2
a      3
b      4
c      5

In [24]:
df2 = pd.DataFrame(data={
    'key': ['a', 'b', 'c', 'd'],
    'data2': range(10, 50, 10)
})
df2

  key  data2
0   a     10
1   b     20
2   c     30
3   d     40

In [25]:
pd.merge(left=df1, right=df2, how='inner', left_index=True, right_on='key')

   data1 key  data2
0      0   a     10
0      3   a     10
1      1   b     20
1      4   b     20
2      2   c     30
2      5   c     30

https://github.com/wesm/pydata-book/tree/2nd-edition/datasets/movielens 폴더에는
movies.data, ratings.dat, users.dat 데이터 파일이 있음.

1. 각 파일을 읽어서 movies, ratings, users 데이터프레임을 생성
2. ratings, movies 데이터 프레임을 merge
    *   inner join, left join을 비교
3. 2에서 생성된 데이터 프레임과 users 데이터 프레임을 merge
    *   inner join, left join을 비교